Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: If an object is a noun, then methods are its verbs (save, print, open).
es: Si un objeto es un sustantivo, entonces los métodos son sus verbos (guardar, imprimir, abrir).

source: If another branch in the inner parentheses was matched, such as in the string 'ACDE', then the C<D> and C<E> would have to be matched as well.
es: Si se detecta otra rama en el paréntesis interior, como en el caso de la cadena 'ACDE', entonces también habría que detectar C<D> y C<E>.

source: If any specific niche has been forgotten, it is not meant as an insult but an omission for the sake of brevity.
es: Si no incluimos algún sector específico, no debe entenderse como menosprecio, sino como una omisión en aras de la brevedad.

source: If at this time, you only want to commit some of the files you have worked on, you can omit the C<-a> and use the command C<S<git add I<FILE ...>>> before doing the commit.
es: Si en este momento sólo desea confirmar parte de los archivos en los que ha trabajado, puede omitir el modificador C<-a> y usar el comando C<S<git add I<ARCHIVO...>>> antes de confirmar.

source: If both conversions are possible without loss of precision, and the operation can be performed without loss of precision then the integer result is used.
es: Si ambas conversiones son posibles sin pérdida de precisión y se puede realizar la operación sin pérdida de precisión, se usa el resultado entero.

source: If in doubt, spell out the character sets in full.
es: En caso de duda, especifique completamente los juegos de caracteres.

source: If it cannot relinquish its privileges, it will not run.
es: Si no puede renunciar a los privilegios, no se ejecutará.

source: If it does guess wrong, or if you're just plain paranoid, you can force the correct interpretation with curly braces as above.
es: Por si se equivoca, o para evitar ataques de paranoia, puede forzar la interpretación correcta con llaves, como se indicó arriba.

source: If it does not then C<undef> is returned.
es: Si no existe, devuelve C<undef>.

source: If it does, life is now officially tough for you, because you have to compile the module yourself (no easy feat on Windows).
es: En ese caso la cosa se complica, ya que tendrá que encargarse de la compilación (algo que no es tarea fácil en Windows).

source: If it fails to find the method, it then goes to the next parent in the original class's C<@ISA> array and searches from there.
es: Si no hay éxito en la búsqueda del método, se pasará a la siguiente clase primaria del array C<@ISA> de la clase original, y la búsqueda continuará desde ahí.

source: If it returns a true value, then no objects of that class will be cloned; or rather, they will be copied as unblessed, undef values.
es: Si devuelve un valor verdadero, no se clonarán objetos de esa clase; o más bien, se copiarán como valores undef no bendecidos.

source: If it wasn't latin-1, then your data is unpleasantly converted.
es: Si la codificación no es latin-1, el resultado de la conversión de los datos no será lo que se esperaba.

source: If it's run from a terminal, F<perldoc> will usually call F<pod2man> to translate POD (Plain Old Documentation - see L<perlpod> for an explanation) into a manpage, and then run F<man> to display it; if F<man> isn't available, F<pod2text> will be used instead and the output piped through your favourite pager.
es: Cuando se ejecuta desde un terminal, normalmente F<perldoc> llama a F<pod2man> para convertir el formato POD (Plain Old Documentation; consulte L<perlpod> para ver una descripción) en una página de manual, y después ejecuta F<man> para mostrarla; si F<man> no está disponible, se usa F<pod2text> y el resultado se canaliza a través de su paginador favorito.

source: If just a raw diff is provided, it is also possible use this two-step process:
es: Si solo se proporciona un archivo de diferencias sin formato, también se puede seguir este proceso en dos pasos:

source: If locale matching rules are in effect, the case map is taken from the current locale for code points less than 255, and from Unicode rules for larger code points.
es: Si están activas las reglas de detección de coincidencias basadas en la configuración regional, la asignación de mayúsculas o minúsculas se basa en la configuración regional actual para los códigos de carácter inferiores a 255 y en las reglas de Unicode para códigos de carácter superiores.

source: If multiple distinct capture groups have the same name then the $+{NAME} will refer to the leftmost defined group in the match.
es: Si varios grupos de captura tienen el mismo nombre, $+{NOMBRE} hará referencia al grupo definido situado más a la izquierda en la coincidencia.

source: If multiple groups have the same name then it refers to the leftmost defined group in the current match.
es: Si varios grupos tienen el mismo nombre, dicho nombre hace referencia al grupo situado más a la izquierda de la coincidencia actual.

source: If multiple parentheses have the same name, then it recurses to the leftmost.
es: Si varios paréntesis tienen el mismo nombre, entonces llega de forma recursiva al que esté más a la izquierda.

source: If new flags are added to Perl, the meaning of the caret's expansion will change to include the default for those flags, so the test will still work, unchanged.
es: Si se agregan nuevas marcas a Perl, el significado de la expansión del signo de intercalación cambiará para incluir el valor predeterminado de estas marcas, por lo que la prueba seguirá funcionando sin cambios.

source: If no C<(*MARK)> of that name was encountered, then the C<(*SKIP)> operator has no effect.
es: Si no se encuentra ningún verbo C<(*MARK)> con ese nombre, el operador C<(*SKIP)> no tiene ningún efecto.

source: If none of the above apply, for backwards compatibility reasons, the C</d> modifier is the one in effect by default.
es: Si no se aplica ninguna de estas situaciones, por compatibilidad con las versiones anteriores el modificador C</d> será el que está activo de manera predeterminada.

source: If not caught, the L<die|perlfunc/die> becomes a fatal error.
es: Si no se captura, la llamada a L<die|perlfunc/die> se convierte en un error irrecuperable.

source: If not, Perl looks at each parent class in turn.
es: Si no, Perl busca en cada clase primaria por orden.

source: If so, these will be entirely transparent to the user of the module.
es: Si es así, esto será completamente transparente para el usuario del módulo.

source: If so, you can install it with C<ppm> and you won't have to bother with any of the other steps here.
es: Si es así, puede instalarlo con C<ppm> y omitir los pasos siguientes.

source: If something in a program isn't the value you're looking for but indicates where the value is, that's indirection.
es: Si algo en un programa no es el valor que se busca, sino una indicación de dónde se puede encontrar el valor, se habla de direccionamiento indirecto.

source: If that class defines the method, then that class's version of the method is called.
es: Si la clase define el método, se llama a la versión del método en la misma.

source: If that is not the case, it will be called a "binary-only" distribution.
es: Si no es así, se dice que la distribución "solo incluye binarios".

source: If the ARG part of the pattern was omitted, then C<$REGERROR> will be set to the name of the last C<(*MARK:NAME)> pattern executed, or to TRUE if there was none.
es: Si se omite la parte ARG del patrón, se establece como valor de C<$REGERROR> el nombre del último patrón C<(*MARK:NOMBRE)> ejecutado, o TRUE si no hay ninguno.

source: If the first character after the "[" is "^", the class matches any character not in the list.
es: Si el primer carácter después de "[" es "^", la clase detectará cualquier carácter que no esté en la lista.

source: If the C<$need> argument is given then it will check that the current version (as defined by the $VERSION variable in the package) is greater than or equal to C<$need>; it will die if this is not the case.
es: Si se incluye el argumento C<$necesaria>, el método comprobará si la versión actual (tal y como se define en la variable $VERSION del paquete) es mayor o igual que C<$necesaria>; el programa finalizará si no se cumple esta condición.

source: If the C<(*ACCEPT)> is inside of capturing groups then the groups are marked as ended at the point at which the C<(*ACCEPT)> was encountered.
es: Si C<(*ACCEPT)> se encuentra dentro de grupos de captura, se marcan los grupos como terminados en el lugar en que se encontró el patrón C<(*ACCEPT)>.

source: If the C</x> modifier enables whitespace formatting, a simple C<#> will suffice.
es: Si el modificador C</x> habilita el uso de espacio en blanco para dar formato, bastará un simple C<#>.

source: If the C<< decimal string --> native integer >> conversion cannot be done without loss of information, the result is compatible with the conversion sequence C<< decimal_string --> native_floating_point --> native_integer >>.
es: Si no se puede aplicar la conversión C<< cadena decimal --> entero nativo >> sin pérdida de información, el resultado es compatible con la secuencia de conversiones C<< cadena decimal --> punto flotante nativo --> entero nativo >>.

source: If the C<POD2::E<lt>language_codeE<gt>> package isn't installed in your system, the switch is ignored.
es: Si el paquete C<POD2::E<lt>código_idiomaE<gt>> no está instalado en el sistema, se ignorará el modificador.

source: If the left hand side is a package name, it looks for the method in that package.
es: Si hay un nombre de un paquete, busca el método en dicho paquete.

source: If the left hand side is an object, then Perl looks for the method in the package that the object has been blessed into.
es: Si hay un objeto, entonces Perl busca el método en el paquete usado para bendecirlo.

source: If the left hand side is neither a package name nor an object, then the method call will cause an error, but see the section on L</Method Call Variations> for more nuances.
es: Si no hay ni un nombre de paquete ni un objeto, entonces la llamada al método producirá un error; consulte la sección L</Variantes en las llamadas a los métodos> para obtener más información.

source: If the method exists, then a reference to the subroutine is returned.
es: Si el método existe, devuelve una referencia a la subrutina.

source: If the module is targeted specifically at a platform other than yours, you're out of luck, most likely.
es: Si el módulo se destina específicamente a una plataforma diferente a la suya, lo más probable es que no consiga instalarlo.

source: If the module you want isn't listed there, you can test it yourself and let CPAN Testers know, you can join CPAN Testers, or you can request it be tested.
es: Si el módulo que desea no está en la lista, puede probarlo usted mismo y comunicar el resultado al grupo de CPAN Testers, puede unirse al grupo de CPAN Testers o puede solicitar que prueben ese módulo.

source: If the name is given in UTF-8, set this to C.
es: Si se proporciona el nombre codificado en UTF-8, debe establecer C como valor de kflags.

source: If the package name is null, the C<main> package is assumed.
es: Si se omite el nombre del paquete, se supondrá que es C<main>.

source: If the pattern begins with a C<U>, the resulting string will be treated
es: Si el patrón comienza con una C<U>, la cadena resultante se tratará

source: If the pattern was used as follows
es: Si el patrón se usa de esta manera:

source: If the source number can be represented in the target form, that representation is used.
es: Si el número de origen se puede representar en la forma de destino, se usa esa representación.

source: If the source number is between two numbers representable in the target form, a representation of one of these numbers is used.
es: Si el número de origen está entre dos números representables en la forma de destino, se usa una representación de uno de estos números.

source: If the source number is outside of the limits representable in the target form, a representation of the closest limit is used.
es: Si el número de origen está fuera de los límites representables en la forma de destino, se usa una representación del límite más cercano.

source: If the subroutine returns a meaningful L</value>, it is also called a L</function>.
es: Si la subrutina devuelve un L</valor> significativo, también se denomina L</función>.

source: If there are any key/value pairs, it returns true; more precisely, the value returned is a string consisting of the number of used buckets and the number of allocated buckets, separated by a slash.
es: Si contiene algún par clave/valor, devuelve verdadero; dicho con mayor exactitud, el valor devuelto es una cadena que consiste en el número de casillas utilizadas y el número de casillas asignadas, separados por una barra diagonal.

source: If there is a subroutine named C<Class()> in the current namespace, Perl will always interpret C<< Class->new() >> as the second alternative: a call to C<new()> on the object returned by a call to C<Class()>
es: Si hay una subrutina llamada C<Clase()> en el espacio de nombres actual, Perl siempre interpretará C<< Clase->new() >> como la segunda alternativa: una llamada a C<new()> sobre el objeto devuelto por la llamada a C<Clase()>.

source: If there is no corresponding capture group defined, then it is a fatal error.
es: Si no hay ningún grupo de captura correspondiente definido, se producirá un error irrecuperable.

source: If there is no current package (due to an empty C<package;> directive), __PACKAGE__ is the undefined value.
es: Si no hay ningún paquete actual (debido a una directiva C<package;> vacía), __PACKAGE__ tiene el valor indefinido

source: If there's something you need to do, then it's probably already been done, and a working example is usually available for free.
es: Cuando se enfrente a un problema, es probable que pueda obtener un ejemplo que funciona (generalmente gratis) de alguien que lo haya hecho ya.

source: If they are not then you might have decompressed them incorrectly.
es: Si no fuera así, es posible que no los haya descomprimido correctamente.

source: If things aren't broken, upgrading perl may break them (or at least issue new warnings).
es: Si todo funciona bien, la situación puede cambiar al actualizar perl (como mínimo pueden surgir nuevas advertencias).

source: If this command lists any paths that don't exist on your system, then you may need to move the appropriate libraries to these locations, or create symbolic links, aliases, or shortcuts appropriately.
es: Si este comando muestra rutas de acceso que no existen en el sistema, es posible que tenga que mover las bibliotecas necesarias a estas ubicaciones o crear los vínculos simbólicos, alias o accesos directos correspondientes.

source: If this is true of an operation it will be mentioned in the documentation for that operation.
es: Si esto es así para una operación determinada, se indicará en la documentación correspondiente a esa operación.

source: If we add a C<(*PRUNE)> before the count like the following
es: Si agregamos C<(*PRUNE)> antes de la cuenta,

source: If we call a method on a C<Child> object and that method is not defined in the C<Child> class, Perl will look for that method in the C<Parent> class and then, if necessary, in the C<Grandparent> class.
es: Si se llama a un método en un objeto de la clase C<Hijo> y el método no está definido en la clase C<Hijo>, Perl buscará el método en la clase C<Padre> y después, si es necesario, en la clase C<Abuelo>.

source: If we created an object to represent F</etc/hostname> on a machine named "foo.example.com", that object's path would be "/etc/hostname", its content would be "foo\n", and it's last modification time would be 1304974868 seconds since the beginning of the epoch.
es: Si se crea un objeto para representar el archivo F</etc/hostname> en un equipo llamado "foo.ejemplo.com", la ruta del objeto sería "/etc/hostname", su contenido "foo\n" y la hora de la última modificación podría ser de 1304974868 segundos desde el principio del tiempo Unix.

source: If we try to set it to an invalid value, our code will throw an error.
es: Si se intenta asignar un valor no válido el código generará un error.

source: If we wanted to include the mp3's title in the greeting, we could override the method:
es: Si deseamos incluir el título del archivo mp3 en el saludo podemos sobrescribir el método:

source: If you I<need> to use literal backslashes within C<\Q...\E>, consult L<perlop/"Gory details of parsing quoted constructs">.
es: Si I<necesita> usar barras diagonales inversas literales dentro de C<\Q...\E>, consulte L<perlop/"Detalles complejos del análisis de construcciones entrecomilladas">.

source: If you L<fork|perlfunc/fork>, you must clean up after your child processes when they exit, or else the process table will fill up and your system administrator will Not Be Happy with you.
es: Si usó L<fork|perlfunc/fork>, debe realizar la limpieza de los procesos derivados que finalicen; de lo contrario, la tabla del proceso se llenará y esto no gustará nada al administrador del sistema.

source: If you don't work on a topic branch the maintainer has to manually cherry pick your changes onto blead before they can be applied.
es: Si no trabaja en una rama puntual, el mantenedor tendrá que seleccionar manualmente los cambios que va a incorporar a blead antes de poder aplicarlos.

source: If you happen to be a L</class>, your ancestors are called L<base classes|/base class> and your descendants are called L<derived classes|/derived class>.
es: Si usted fuera una L</clase>, sus antepasados serían L<clases base|/clase base> y sus descendientes serían L<clases derivadas|/clase derivada>.

source: If you have a package called C<m>, C<s>, or C<y>, then you can't use the qualified form of an identifier because it would be instead interpreted as a pattern match, a substitution, or a transliteration.
es: Si tiene un paquete llamado C<m>, C<s> o C<y>, no puede usar la forma calificada de un identificador, ya que podría interpretarse como una detección de patrones, una substitución o una transliteración.

source: If you need text in a binary stream, encode your text strings first using the appropriate encoding, then join them with binary strings.
es: Si necesita texto en una secuencia binaria, codifique las cadenas de texto con la codificación adecuada y después únalas con cadenas binarias.

source: If you override this method, it should never throw an exception.
es: Si sobrescribe este método, no debe generar nunca una excepción.

source: If you say
es: Si escribe

source: If you actually want the key to be stored in the DBM database as a C int, you will have to use C<pack> when writing, and C<unpack> when reading.
es: Si desea almacenarla como un entero de C, debe usar C<pack> al escribir y C<unpack> al leer.

source: If you add new tests (or new modules with tests), you may need to update the F<t/TEST> file so that the tests are run.
es: Si agrega pruebas nuevas (o módulos nuevos con pruebas), es posible que tenga que actualizar el archivo F<t/TEST> para que se ejecuten.

source: If you already have a Perl repository, you should ensure that you're on the I<blead> branch, and your repository is up to date:
es: Si ya tiene un repositorio de Perl, debe asegurarse de que está en la rama I<blead> y que el repositorio está actualizado:

source: If you approve of a specific commit, you can cherry pick it:
es: Si aprueba una confirmación específica, puede seleccionarla:

source: If you are just interested in working on a quick patch, see L<perlhack> first.
es: Si solo desea crear un parche rápido, consulte primero L<perlhack>.

source: If you are a committer to Perl and you think the patch is good, you can then merge it into blead then push it out to the main repository:
es: Si tiene permiso para contribuir cambios a Perl y considera que el parche es correcto, puede combinarlo en blead y después enviarlo al repositorio principal:

source: If you are interested in the guts underlying these systems, check out L<perlobj>.
es: Si está interesado en conocer los detalles de estos sistemas, consulte L<perlobj>.

source: If you are looking for a "bar" that isn't preceded by a "foo", C</(?!foo)bar/> will not do what you want.
es: Si busca una instancia de "bar" que no esté precedida de "foo", C</(?!foo)bar/> no hará lo que espera.

source: If you are looking for a table of contents to the Perl library modules documentation, see the L<perltoc> page.
es: En la página L<perltoc> encontrará una tabla de contenido de la documentación de los módulos de biblioteca de Perl.

source: If you are not the creator of B<yourname>/B<some_descriptive_name>, you might sometimes find that the original author has edited the branch's history.
es: Si no es el autor de B<nombre>/B<nombre_descriptivo>, a veces verá que el autor original ha editado el historial de la rama.

source: If you are unsure about the proper location of a file that may have gotten copied while building the source distribution, consult the C<MANIFEST>.
es: Si no está seguro de cuál es la ubicación correcta de un archivo que podría haberse copiado al compilar la distribución de código fuente, consulte el archivo C<MANIFEST>.

source: If you are using cpan-mac, just drop the folder on the B<installme> droplet, and use the module.
es: Si usa cpan-mac, simplemente coloque la carpeta en el I<droplet> B<installme> y ya podrá usar el módulo.

source: If you are using named captures in a branch reset pattern, it's best to use the same names, in the same order, in each of the alternations:
es: Si usa capturas con nombre en un patrón de reinicio de rama, es mejor utilizar los mismos nombres, en el mismo orden, en cada una de las alternativas:

source: If you are working with a git clone of the Perl repository, you will want to create a branch for your changes.
es: Si trabaja con un clon del repositorio git de Perl, tendrá que crear una rama para incorporar sus cambios.

source: If you assign directly to C<$_[0]> you will change the contents of the variable that holds the reference to the object.
es: Si asigna un valor directamente a C<$_[0]>, cambiará el contenido de la variable que contiene la referencia al objeto.

source: If you attempt to call a method on an object that isn't defined in its own class, Perl will also look for that method in any parent classes it may have.
es: Si intenta llamar a un método no definido en la clase del objeto que hace la llamada, Perl lo buscará también en las clases primarias del objeto.

source: If you call C<ref($thing)> and C<$thing> holds a reference to an object, it will return the name of the class that the object has been blessed into.
es: Si llama a C<ref($algo)> y C<$algo> contiene una referencia a un objeto, devolverá el nombre de la clase en la que se bendijo el objeto.

source: If you call a method that doesn't exist in a class, Perl will throw an error.
es: Si llama a un método que no existe en una clase, Perl generará un error.

source: If you can't remember what mnemonic means, you've got a problem.
es: Si no puede recordar el significado de "mnemotécnico", tiene un problema.

source: If you cannot use the git protocol for firewall reasons, you can also clone via http, though this is much slower:
es: Si un firewall le impide usar el protocolo git, puede clonar el repositorio a través de http, aunque este método es mucho más lento:

source: If you choose not to use cpan-mac for some reason, there are alternatives listed here.
es: Si prefiere no utilizar cpan-mac por alguna razón, abajo se indican algunas alternativas.

source: If you choose to use Moose, it comes with a full-fledged role implementation.
es: Si elige usar Moose, dispondrá de una implementación completa de los roles.
